sivantoledo/vildehaye-firmware/vildehaye-common/cc13x0_peripherals_setup_3_20.c
#if defined(DeviceFamily_CC13X0) || defined(DeviceFamily_CC13X2)
/*
 * Copyright (c) 2015-2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ====================== CC1310_LAUNCHXL.c ===================================
 *  This file is responsible for setting up the board specific items for the
 *  CC1310 LaunchPad.
 */

// ======================== temporary place for the rf callback =================
#include <stdlib.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

//#include <ti/devices/cc13x0/driverlib/ioc.h>
//#include <ti/devices/cc13x0/driverlib/cpu.h>

#include <ti/devices/DeviceFamily.h>
#include DeviceFamily_constructPath(driverlib/ioc.h)
#include DeviceFamily_constructPath(driverlib/cpu.h)


#include <ti/drivers/rf/RF.h>
#include <ti/drivers/pin/PINCC26XX.h>


void rfDriverCallback(RF_Handle client, RF_GlobalEvent events, void *arg)
{
  return;
#if 0
    /* Decode input arguments. */
    (void)client;
    RF_RadioSetup* setupCommand = (RF_RadioSetup*)arg;

    /* Local variable. */
    bool    sub1GHz   = false;
    uint8_t loDivider = 0;

    if (events & RF_GlobalEventRadioSetup) {
        /* Power up the antenna switch */
        PINCC26XX_setOutputValue(Board_RF_POWER, 1);

        /* Decision about the frequency band shall be made based on the
           loDivider field. */
        switch (setupCommand->common.commandNo) {
            case (CMD_RADIO_SETUP):
            case (CMD_BLE5_RADIO_SETUP):
                    loDivider = RF_LODIVIDER_MASK & setupCommand->common.loDivider;

                    /* Sub-1 GHz, requires antenna switch high. */
                    if ((loDivider != 0) && (loDivider != 2)) {
                            sub1GHz = true;
                    }
                    break;
            case (CMD_PROP_RADIO_DIV_SETUP):
                    loDivider = RF_LODIVIDER_MASK & setupCommand->prop_div.loDivider;

                    /* Sub-1 GHz, requires antenna switch high. */
                    if ((loDivider != 0) && (loDivider != 2)) {
                            sub1GHz = true;
                    }
                    break;
            default:break;
        }

        /* Select the correct antenna. */
        if (sub1GHz) {
            PINCC26XX_setOutputValue(Board_RF_SUB1GHZ, 1);
        }
        else {
            PINCC26XX_setOutputValue(Board_RF_SUB1GHZ, 0);
        }
    }
    else if (events & RF_GlobalEventRadioPowerDown) {
        /* Disable antenna switch to save current */
        PINCC26XX_setOutputValue(Board_RF_POWER, 0);
        PINCC26XX_setOutputValue(Board_RF_SUB1GHZ, 0);
    }
#endif
}

/*
 *  ====================== Includes ============================================
 */
#if 0
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include <ti/devices/cc13x0/driverlib/ioc.h>
#include <ti/devices/cc13x0/driverlib/udma.h>
#include <ti/devices/cc13x0/inc/hw_ints.h>
#include <ti/devices/cc13x0/inc/hw_memmap.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>
#include <ti/drivers/timer/GPTimerCC26XX.h>
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>
#endif

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include <ti/devices/DeviceFamily.h>
#include DeviceFamily_constructPath(driverlib/ioc.h)
#include DeviceFamily_constructPath(driverlib/udma.h)
#include DeviceFamily_constructPath(inc/hw_ints.h)
#include DeviceFamily_constructPath(inc/hw_memmap.h)
#include <ti/drivers/power/PowerCC26XX.h>
#ifdef DeviceFamily_CC13X2
#include <ti/drivers/power/PowerCC26X2.h>
#endif

#include "config.h"

#include "cc13x0_peripherals_setup_3_20.h"

#ifndef BOARD_I2C0_SCL
#warning "CC13X0 I2C Peripheral 0 is not linked to any pins"
#define BOARD_I2C0_SCL PIN_UNASSIGNED
#endif

#ifndef BOARD_I2C0_SDA
#define BOARD_I2C0_SDA PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI0_SCLK
#warning "CC13X0 SPI Peripheral 0 is not linked to any pins"
#define BOARD_SPI0_SCLK PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI0_MOSI
#define BOARD_SPI0_MOSI PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI0_MISO
#define BOARD_SPI0_MISO PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI0_CSN
#define BOARD_SPI0_CSN PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI1_SCLK
#warning "CC13X0 SPI Peripheral 1 is not linked to any pins"
#define BOARD_SPI1_SCLK PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI1_MOSI
#define BOARD_SPI1_MOSI PIN_UNASSIGNED
#endif

