sivantoledo/vildehaye-firmware/vildehaye-common/cc13x0_peripherals_setup_3_20.c
const uint_least8_t ADC_count = CC1350_LAUNCHXL_433_ADCCOUNT;

/*
 *  =============================== Crypto ===============================
 */

// Sivan Sep 2020: this driver is obsolete and we do not use it anyway.

#ifdef OBSOLETE
#include <ti/drivers/crypto/CryptoCC26XX.h>

CryptoCC26XX_Object cryptoCC26XXObjects[CC1350_LAUNCHXL_433_CRYPTOCOUNT];

const CryptoCC26XX_HWAttrs cryptoCC26XXHWAttrs[CC1350_LAUNCHXL_433_CRYPTOCOUNT] = {
    {
        .baseAddr       = CRYPTO_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_CRYPTO,
        .intNum         = INT_CRYPTO_RESULT_AVAIL_IRQ,
        .intPriority    = ~0,
    }
};

const CryptoCC26XX_Config CryptoCC26XX_config[CC1350_LAUNCHXL_433_CRYPTOCOUNT] = {
    {
         .object  = &cryptoCC26XXObjects[CC1350_LAUNCHXL_433_CRYPTO0],
         .hwAttrs = &cryptoCC26XXHWAttrs[CC1350_LAUNCHXL_433_CRYPTO0]
    },
};
#endif
/*
 *  =============================== AESCCM ===============================
 */
#include <ti/drivers/AESCCM.h>
#include <ti/drivers/aesccm/AESCCMCC26XX.h>

AESCCMCC26XX_Object aesccmCC26XXObjects[CC1350_LAUNCHXL_433_AESCCMCOUNT];

const AESCCMCC26XX_HWAttrs aesccmCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESCCMCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCCM_Config AESCCM_config[CC1350_LAUNCHXL_433_AESCCMCOUNT] = {
    {
         .object  = &aesccmCC26XXObjects[CC1350_LAUNCHXL_433_AESCCM0],
         .hwAttrs = &aesccmCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESCCM0]
    },
};

const uint_least8_t AESCCM_count = CC1350_LAUNCHXL_433_AESCCMCOUNT;


/*
 *  =============================== AESGCM ===============================
 */
#include <ti/drivers/AESGCM.h>
#include <ti/drivers/aesgcm/AESGCMCC26XX.h>

AESGCMCC26XX_Object aesgcmCC26XXObjects[CC1350_LAUNCHXL_433_AESGCMCOUNT];

const AESGCMCC26XX_HWAttrs aesgcmCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESGCMCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESGCM_Config AESGCM_config[CC1350_LAUNCHXL_433_AESGCMCOUNT] = {
    {
         .object  = &aesgcmCC26XXObjects[CC1350_LAUNCHXL_433_AESGCM0],
         .hwAttrs = &aesgcmCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESGCM0]
    },
};

const uint_least8_t AESGCM_count = CC1350_LAUNCHXL_433_AESGCMCOUNT;

/*
 *  =============================== AESCBC ===============================
 */
#include <ti/drivers/AESCBC.h>
#include <ti/drivers/aescbc/AESCBCCC26XX.h>

AESCBCCC26XX_Object aescbcCC26XXObjects[CC1350_LAUNCHXL_433_AESCBCCOUNT];

const AESCBCCC26XX_HWAttrs aescbcCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESCBCCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCBC_Config AESCBC_config[CC1350_LAUNCHXL_433_AESCBCCOUNT] = {
    {
         .object  = &aescbcCC26XXObjects[CC1350_LAUNCHXL_433_AESCBC0],
         .hwAttrs = &aescbcCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESCBC0]
    },
};

const uint_least8_t AESCBC_count = CC1350_LAUNCHXL_433_AESCBCCOUNT;

/*
 *  =============================== AESCTR ===============================
 */
#include <ti/drivers/AESCTR.h>
#include <ti/drivers/aesctr/AESCTRCC26XX.h>

AESCTRCC26XX_Object aesctrCC26XXObjects[CC1350_LAUNCHXL_433_AESCTRCOUNT];

const AESCTRCC26XX_HWAttrs aesctrCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESCTRCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCTR_Config AESCTR_config[CC1350_LAUNCHXL_433_AESCTRCOUNT] = {
    {
         .object  = &aesctrCC26XXObjects[CC1350_LAUNCHXL_433_AESCTR0],
         .hwAttrs = &aesctrCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESCTR0]
    },
};

const uint_least8_t AESCTR_count = CC1350_LAUNCHXL_433_AESCTRCOUNT;

/*
 *  =============================== AESECB ===============================
 */
#include <ti/drivers/AESECB.h>
#include <ti/drivers/aesecb/AESECBCC26XX.h>

AESECBCC26XX_Object aesecbCC26XXObjects[CC1350_LAUNCHXL_433_AESECBCOUNT];

const AESECBCC26XX_HWAttrs aesecbCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESECBCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESECB_Config AESECB_config[CC1350_LAUNCHXL_433_AESECBCOUNT] = {
    {
         .object  = &aesecbCC26XXObjects[CC1350_LAUNCHXL_433_AESECB0],
         .hwAttrs = &aesecbCC26XXHWAttrs[CC1350_LAUNCHXL_433_AESECB0]
    },
};

const uint_least8_t AESECB_count = CC1350_LAUNCHXL_433_AESECBCOUNT;

/*
 *  =============================== AESCTRDRBG ===============================
 */
#include <ti/drivers/AESCTRDRBG.h>
#include <ti/drivers/aesctrdrbg/AESCTRDRBGXX.h>

AESCTRDRBGXX_Object aesctrdrbgXXObjects[CC1350_LAUNCHXL_433_AESCTRDRBGCOUNT];

const AESCTRDRBGXX_HWAttrs aesctrdrbgXXHWAttrs[CC1350_LAUNCHXL_433_AESCTRDRBGCOUNT] = {
    {
        .aesctrIndex       = CC1350_LAUNCHXL_433_AESCTR0,
    }
};

const AESCTRDRBG_Config AESCTRDRBG_config[CC1350_LAUNCHXL_433_AESCTRDRBGCOUNT] = {
    {
         .object  = &aesctrdrbgXXObjects[CC1350_LAUNCHXL_433_AESCTRDRBG0],
         .hwAttrs = &aesctrdrbgXXHWAttrs[CC1350_LAUNCHXL_433_AESCTRDRBG0]
    },
};

const uint_least8_t AESCTRDRBG_count = CC1350_LAUNCHXL_433_AESCTRDRBGCOUNT;

/*
 *  =============================== TRNG ===============================
 */
#include <ti/drivers/TRNG.h>
#include <ti/drivers/trng/TRNGCC26XX.h>

TRNGCC26XX_Object trngCC26XXObjects[CC1350_LAUNCHXL_433_TRNGCOUNT];

const TRNGCC26XX_HWAttrs trngCC26X2HWAttrs[CC1350_LAUNCHXL_433_TRNGCOUNT] = {
    {
        .intPriority       = ~0,
        .swiPriority       = 0,
        .samplesPerCycle   = 240000,
    }
};

const TRNG_Config TRNG_config[CC1350_LAUNCHXL_433_TRNGCOUNT] = {
    {
         .object  = &trngCC26XXObjects[CC1350_LAUNCHXL_433_TRNG0],
         .hwAttrs = &trngCC26X2HWAttrs[CC1350_LAUNCHXL_433_TRNG0]
    },
};

const uint_least8_t TRNG_count = CC1350_LAUNCHXL_433_TRNGCOUNT;


/*
 *  =============================== Display ===============================
 */
#include <ti/display/Display.h>
#include <ti/display/DisplayUart.h>
#include <ti/display/DisplaySharp.h>

#ifndef BOARD_DISPLAY_UART_STRBUF_SIZE
#define BOARD_DISPLAY_UART_STRBUF_SIZE    128
#endif

/* This value can be changed to 96 for use with the 430BOOST-SHARP96 BoosterPack. */
#define BOARD_DISPLAY_SHARP_SIZE    128

DisplayUart_Object     displayUartObject;
DisplaySharp_Object    displaySharpObject;

